Revit 2024 API
AdvancedLossFactor Constructor (Double, Double, Double, Double, Double, Double, Double)
 Creates an advanced loss factor object with the given values.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public AdvancedLossFactor(
	double ballastLossFactorIn,
	double lampLumenDepreciationIn,
	double lampTiltLossFactorIn,
	double luminaireDirtDepreciationIn,
	double surfaceDepreciationLossFactorIn,
	double temperatureLossFactorIn,
	double voltageLossFactorIn
)
Visual Basic
Public Sub New ( _
	ballastLossFactorIn As Double, _
	lampLumenDepreciationIn As Double, _
	lampTiltLossFactorIn As Double, _
	luminaireDirtDepreciationIn As Double, _
	surfaceDepreciationLossFactorIn As Double, _
	temperatureLossFactorIn As Double, _
	voltageLossFactorIn As Double _
)
Visual C++
public:
AdvancedLossFactor(
	double ballastLossFactorIn,
	double lampLumenDepreciationIn,
	double lampTiltLossFactorIn,
	double luminaireDirtDepreciationIn,
	double surfaceDepreciationLossFactorIn,
	double temperatureLossFactorIn,
	double voltageLossFactorIn
)
Parameters
ballastLossFactorIn
Type: System.Double
 The ballast loss factor as a numerical value between 0.0 and 1.0.
lampLumenDepreciationIn
Type: System.Double
 The lamp lumen depreciation loss factor as a numerical value between 0.0 and 1.0.
lampTiltLossFactorIn
Type: System.Double
 The lamp tilt loss factor as a numerical value between 0.0 and 1.0.
luminaireDirtDepreciationIn
Type: System.Double
 The luminaire dirt depreciation loss factor as a numerical value between 0.0 and 1.0.
surfaceDepreciationLossFactorIn
Type: System.Double
 The surface depreciation loss factor as a numerical value between 0.0 and 1.0.
temperatureLossFactorIn
Type: System.Double
 The temperature loss factor as a numerical value between 0.0 and 2.0.
voltageLossFactorIn
Type: System.Double
 The voltage loss factor as a numerical value between 0.0 and 2.0.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The loss factor is not valid because it is not between 0.0 and 1.0. -or- The loss factor is not valid because it is not between 0.0 and 2.0.
See Also
AdvancedLossFactor Class
AdvancedLossFactor Overload
Autodesk.Revit.DB.Lighting Namespace